Tekla Open API Reference for Tekla Structures 2025
Picker.PickFace Method
 Queries the user to pick a face from the model.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PickInput PickFace()
Public Function PickFace As PickInput
Return Value
Type: PickInput
A list of the vertices of the face and the object the user picked as one PickInput instance.
See Also
Reference
Picker Class
PickFace Overload
Tekla.Structures.Model.UI Namespace